InformationRegisters/QuestioningResults.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>QuestioningResults</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Outlet</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Outlet</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SR</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Questionnaire</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Questionnaire</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Visit</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Visit</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/bitmobile_ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>bitmobile_ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлЗаблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bitmobile_НаправленияСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bitmobile_ДействияПриСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/QuestionsInQuestionnaires.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>QuestionsInQuestionnaires</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Obligatoriness</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ValueTableRowStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ParentQuestion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Question</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Questionnaire</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Questionnaire</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ChildQuestion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Question</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>QuestionType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuestionGroupTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/SKUsInQuestionnaires.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>SKUsInQuestionnaires</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ValueTableRowStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Questionnaire</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Questionnaire</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SKU</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Brands</v8:Type>
						<v8:Type>cfg:CatalogRef.SKUGroup</v8:Type>
						<v8:Type>cfg:CatalogRef.SKU</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/QuestionGroupTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>QuestionGroupTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RegularQuestions</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SKUQuestions</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DataType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>DataType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>String</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Integer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Decimal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Boolean</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DateTime</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ValueList</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Snapshot</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ValueTableRowStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ValueTableRowStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Added</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Modified</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Deleted</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Question.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Question</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.QuestionGroup</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AnswerType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DataType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Assignment</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SKUQuestions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ValueList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/QuestioningResults/Forms/RecordForm/Ext/Form/Module.bsl
#Region CommonProcedureAndFunctions

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FillFileTable();
	
	FillQuestionsTree(Enums.QuestionGroupTypes.RegularQuestions);
	
	FillSKUs();
	
	If Not SKUs.Count() = 0 Then 
		
		FillQuestionsTree(Enums.QuestionGroupTypes.SKUQuestions);
		
	EndIf;
	
	ThisForm.Title = NStr("en='Result for ""';ru='Результат для ""';cz='Vэsledek pro ""'") + String(Record.Questionnaire) + """";
	
EndProcedure

#Region Files

&AtServer
Procedure FillFileNameArray(FileNameArray, Table)

	For Each Element In Table Do 
		
		If ItsPicture(Element.Question) Then 
			
			Try
				
				SnapShotUUID = New UUID(Element.Answer);
				
			Except
				
				SnapShotUUID = Undefined;	
				
			EndTry;
				
			If Not SnapShotUUID = Undefined Then 
		
				FileNameArray.Add(SnapShotUUID);	
				
			EndIf;
			
		EndIf;	
		
	EndDo; 
		
EndProcedure

&AtServer
Procedure FillFileTable()
	
	ThumbnailSize = Constants.SizeOfThumbnailPhotos.Get();
	
	Connection = CommonProcessors.GetConnectionToServer();
	
	Path = CommonProcessors.GetWebDAVPathOnServer();
	
	FileNameArray = New Array; 
	
	FillFileNameArray(FileNameArray, Record.Visit.Questions);
	
	FillFileNameArray(FileNameArray, Record.Visit.SKUs);
		
	Query = New Query;
	Query.Text = 
		"SELECT ALLOWED
		|	bitmobile_ХранилищеФайлов.Объект,
		|	bitmobile_ХранилищеФайлов.НаправлениеСинхронизации,
		|	bitmobile_ХранилищеФайлов.Действие,
		|	bitmobile_ХранилищеФайлов.ИмяФайла,
		|	bitmobile_ХранилищеФайлов.ПолноеИмяФайла,
		|	bitmobile_ХранилищеФайлов.Расширение,
		|	bitmobile_ХранилищеФайлов.Хранилище
		|FROM
		|	InformationRegister.bitmobile_ХранилищеФайлов AS bitmobile_ХранилищеФайлов
		|WHERE
		|	bitmobile_ХранилищеФайлов.ИмяФайла IN(&FileNameArray)";
	
	Query.SetParameter("FileNameArray", FileNameArray);
	
	FileTableRegister = Query.Execute().Unload();
	
	For Each Str In FileTableRegister Do  
	
 		BinaryDataOfFile = Str.Хранилище.Get();
		
		If ValueIsFilled(BinaryDataOfFile) Then 
			
			Ins					= FileTable.Add();
			Ins.FileName		= Str.ИмяФайла;
			Ins.StorageAddress	= PutToTempStorage(BinaryDataOfFile, ThisForm.UUID);
			Ins.Extension		= Str.Расширение;
			
		Else 
			
			If Not Connection = Undefined Then 
			
				Try
					
					WebDAVFile = GetTempFileName(Str.Расширение);
					
					If ThumbnailSize > 0 Then 
						
						Connection.Get(Path + Lower(Str.ПолноеИмяФайла) + "?size=" + Format(ThumbnailSize, "NG=0"), WebDAVFile);
						
					Else 
						
						Connection.Get(Path + Lower(Str.ПолноеИмяФайла), WebDAVFile);
						
					EndIf;
					
					BinaryDataOfFile = New BinaryData(WebDAVFile);
					
					Ins					= FileTable.Add();
					Ins.FileName		= Str.ИмяФайла;
					Ins.StorageAddress	= PutToTempStorage(BinaryDataOfFile, ThisForm.UUID);
					Ins.Extension		= Str.Расширение;
					
				Except
				EndTry;
				
			EndIf;	
			
		EndIf;	
				
	EndDo;
				
EndProcedure

&AtServer
Procedure SetPicture(SnapShotUUID)
	
	FindStructure = New Structure("FileName");
	FindStructure.FileName = SnapShotUUID;
	
	FoundRows = FileTable.FindRows(FindStructure);
	
	If Not FoundRows.Count() = 0 Then 
		
		PictureAddress 		= FoundRows[0].StorageAddress;
		PictureExtension	= FoundRows[0].Extension;
				
	EndIf;
				
EndProcedure

&AtServer
Function ItsPicture(Question)
	
	If Question.AnswerType = Enums.DataType.Snapshot Then 
		
		Return True;
		
	Else 
		
		Return False;
		
	EndIf;
			
EndFunction

&AtServer
Function PictureExists(SnapShotUUID)
	
	FindStructure = New Structure("FileName");
	FindStructure.FileName = SnapShotUUID;
	
	FoundRows = FileTable.FindRows(FindStructure);
	
	If Not FoundRows.Count() = 0 Then 
		
		Return True;
		
	Else
		
		Return False;
				
	EndIf;

EndFunction

#EndRegion

#Region Questions

&AtServer
Procedure FillQuestionsTree(GroupType)
	
	If GroupType = Enums.QuestionGroupTypes.RegularQuestions Then 
			
		Tree = Questions;
			
	Else 
			
		Tree = SKUQuestions;
			
	EndIf;	
			
	If ValueIsFilled(Record.Questionnaire) Then 
	
		// Заполнить список вопросов
		Query = New Query;
		Query.Text = 
			"SELECT ALLOWED
			|	QuestionsInQuestionnairesSliceLast.Period,
			|	QuestionsInQuestionnairesSliceLast.Questionnaire,
			|	QuestionsInQuestionnairesSliceLast.ParentQuestion,
			|	QuestionsInQuestionnairesSliceLast.ChildQuestion,
			|	QuestionsInQuestionnairesSliceLast.QuestionType,
			|	QuestionsInQuestionnairesSliceLast.Obligatoriness,
			|	QuestionsInQuestionnairesSliceLast.Status,
			|	QuestionsInQuestionnairesSliceLast.Order
			|FROM
			|	InformationRegister.QuestionsInQuestionnaires.SliceLast AS QuestionsInQuestionnairesSliceLast
			|WHERE
			|	NOT QuestionsInQuestionnairesSliceLast.Status = VALUE(Enum.ValueTableRowStatuses.Deleted)
			|	AND QuestionsInQuestionnairesSliceLast.Questionnaire = &Questionnaire
			|	AND QuestionsInQuestionnairesSliceLast.QuestionType = &GroupType";

		Query.SetParameter("Questionnaire", Record.Questionnaire);
		Query.SetParameter("GroupType", GroupType);
			
		QuestionsTable = Query.Execute().Unload();

		ParentQuestionsTable = QuestionsTable.Copy(New Structure("ParentQuestion", Catalogs.Question.EmptyRef()));
		
		ParentQuestionsTable.Sort("Order Asc");
		
		For Each ParentQuestionRow In ParentQuestionsTable Do 
			
			ParentRow 					= Tree.GetItems().Add();
			ParentRow.Question       	= ParentQuestionRow.ChildQuestion;
			ParentRow.Obligatoriness    = ParentQuestionRow.Obligatoriness;
			ParentRow.AnswerType        = ParentQuestionRow.ChildQuestion.AnswerType;
			
			If GroupType = Enums.QuestionGroupTypes.RegularQuestions Then 
				
				FoundStructure = New Structure("Questionnaire, Question", Record.Questionnaire, ParentRow.Question);
				
				FoundedAnswers = Record.Visit.Questions.FindRows(FoundStructure);
				
				If Not FoundedAnswers.Count() = 0 Then 
				
					If ItsPicture(ParentRow.Question) Then
					
						Try
							
							SnapShotUUID = New UUID(FoundedAnswers[0].Answer);
							
							If PictureExists(SnapShotUUID) Then
							
				            	ParentRow.Answer 			= NStr("en='Snapshot';ru='Фотоснимок';cz='Foto'");
				            	ParentRow.SnapShotUUID 		= FoundedAnswers[0].Answer;
								
							Else
								
								ParentRow.Answer = NStr("en='Snapshot not found on server';ru='Фотоснимок не найден на сервере';cz='Foto nebylo nalezeno na serveru'");
													
							EndIf;
							
						Except
							
							ParentRow.Answer = NStr("en='Error getting snapshot';ru='Ошибка при получении фотоснимка';cz='Chyba během pořízení foto'");
							
						EndTry;
						
					Else 
	            
			            ParentRow.Answer = FoundedAnswers[0].Answer;
			            
					EndIf;
					
				EndIf;	
					
			EndIf;
			
			ChildQuestionsTable = QuestionsTable.Copy(New Structure("ParentQuestion", ParentQuestionRow.ChildQuestion));
			
			ChildQuestionsTable.Sort("Order Asc");
			
			For Each ChildQuestionRow In ChildQuestionsTable Do 
				
				ChildRow 				= ParentRow.GetItems().Add();
				ChildRow.Question       = ChildQuestionRow.ChildQuestion;
				ChildRow.Obligatoriness	= ChildQuestionRow.Obligatoriness;
				ChildRow.AnswerType     = ChildQuestionRow.ChildQuestion.AnswerType;
				
				If GroupType = Enums.QuestionGroupTypes.RegularQuestions Then 
					
					FoundStructure = New Structure("Questionnaire, Question", Record.Questionnaire, ChildRow.Question);
					
					FoundedAnswers = Record.Visit.Questions.FindRows(FoundStructure);
					
					If Not FoundedAnswers.Count() = 0 Then 
					
						If ItsPicture(ChildRow.Question) Then
						
							Try
								
								SnapShotUUID = New UUID(FoundedAnswers[0].Answer);
								
								If PictureExists(SnapShotUUID) Then
								
					            	ChildRow.Answer 			= NStr("en='Snapshot';ru='Фотоснимок';cz='Foto'");
					            	ChildRow.SnapShotUUID 		= FoundedAnswers[0].Answer;
									
								Else
									
									ChildRow.Answer = NStr("en='Snapshot not found on server';ru='Фотоснимок не найден на сервере';cz='Foto nebylo nalezeno na serveru'");
														
								EndIf;
								
							Except
								
								ChildRow.Answer = NStr("en='Error getting snapshot';ru='Ошибка при получении фотоснимка';cz='Chyba během pořízení foto'");
								
							EndTry;
							
						Else 
		            
				            ChildRow.Answer = FoundedAnswers[0].Answer;
				            
						EndIf;
						
					EndIf;	
						
				EndIf;
				
			EndDo;
						
		EndDo;
				
	EndIf;
		
EndProcedure

&AtServer
Procedure LoadSKUAnswers(SKU)
	
	For Each ParentQuestionElement In SKUQuestions.GetItems() Do 
		
		ParentQuestionElement.Answer 			= "";
		ParentQuestionElement.SKUSnapShotUUID 	= "";
		
		FoundedAnswers = Record.Visit.SKUs.FindRows(New Structure("Questionnaire, Question, SKU", Record.Questionnaire, ParentQuestionElement.Question, SKU));       
		
		If Not FoundedAnswers.Count() = 0 Then 
		
			If ItsPicture(ParentQuestionElement.Question) Then
			
				Try
					
					SnapShotUUID = New UUID(FoundedAnswers[0].Answer);
					
					If PictureExists(SnapShotUUID) Then
						
						ParentQuestionElement.Answer 			= NStr("en='Snapshot';ru='Фотоснимок';cz='Foto'");
						ParentQuestionElement.SKUSnapShotUUID 	= FoundedAnswers[0].Answer;
						
					Else
						
						ParentQuestionElement.Answer = NStr("en='Snapshot not found on server';ru='Фотоснимок не найден на сервере';cz='Foto nebylo nalezeno na serveru'");
						
					EndIf;
					
				Except
					
					ParentQuestionElement.Answer = NStr("en='Error getting snapshot';ru='Ошибка при получении фотоснимка';cz='Chyba během pořízení foto'");
					
				EndTry;
				
			Else 
				
				ParentQuestionElement.Answer = FoundedAnswers[0].Answer;
				
			EndIf;
			
		EndIf;
		
		ChildQuestionsTable = ParentQuestionElement.GetItems();
		
		For Each ChildQuestionElement In ChildQuestionsTable Do 
			
			ChildQuestionElement.Answer 			= "";
			ChildQuestionElement.SKUSnapShotUUID 	= "";
		
			FoundedAnswers = Record.Visit.SKUs.FindRows(New Structure("Questionnaire, Question, SKU", Record.Questionnaire, ChildQuestionElement.Question, SKU));       
		
			If Not FoundedAnswers.Count() = 0 Then 
			
				If ItsPicture(ChildQuestionElement.Question) Then
				
					Try
						
						SnapShotUUID = New UUID(FoundedAnswers[0].Answer);
						
						If PictureExists(SnapShotUUID) Then
						
			            	ChildQuestionElement.Answer 			= NStr("en='Snapshot';ru='Фотоснимок';cz='Foto'");
			            	ChildQuestionElement.SKUSnapShotUUID 	= FoundedAnswers[0].Answer;
							
						Else
							
							ChildQuestionElement.Answer = NStr("en='Snapshot not found on server';ru='Фотоснимок не найден на сервере';cz='Foto nebylo nalezeno na serveru'");
												
						EndIf;
						
					Except
						
						ChildQuestionElement.Answer = NStr("en='Error getting snapshot';ru='Ошибка при получении фотоснимка';cz='Chyba během pořízení foto'");
						
					EndTry;
					
				Else 
            
		            ChildQuestionElement.Answer = FoundedAnswers[0].Answer;
		            
				EndIf;
				
			EndIf;
			
		EndDo;
					
	EndDo; 
		
EndProcedure

#EndRegion

#Region SKUs

&AtServer
Procedure FillSKUs()
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	SKUsInQuestionnairesSliceLast.SKU
		|FROM
		|	InformationRegister.SKUsInQuestionnaires.SliceLast(, Questionnaire = &Questionnaire) AS SKUsInQuestionnairesSliceLast
		|WHERE
		|	SKUsInQuestionnairesSliceLast.Status = VALUE(Enum.ValueTableRowStatuses.Added)
		|	AND SKUsInQuestionnairesSliceLast.SKU IN(&SKUArray)
		|
		|GROUP BY
		|	SKUsInQuestionnairesSliceLast.SKU";
	
	Query.SetParameter("Questionnaire", Record.Questionnaire);
	Query.SetParameter("SKUArray", Record.Visit.SKUs.UnloadColumn("SKU"));
	
	SKUs.Load(Query.Execute().Unload());
	
EndProcedure	

#EndRegion

#EndRegion

#Region UserInterface

&AtClient
Procedure OpenPicture(Command)
	
	If Items.GroupPages.CurrentPage = Items.GroupQuestions Then 
		
		If Not Items.Questions.CurrentData = Undefined Then
			
			If ValueIsFilled(Items.Questions.CurrentData.SnapShotUUID) Then 
				
				SnapshotStructure = CommonProcessors.GetSnapshot(Items.Questions.CurrentData.SnapShotUUID, ThisForm.UUID, String(Record.Outlet));
				
				If Not SnapshotStructure = Undefined Then 
				 
					GetFile(SnapshotStructure.SnapshotAddress, SnapshotStructure.SnapshotName, True);
					
				EndIf;
				
			EndIf;
			
		EndIf;
		
	ElsIf Items.GroupPages.CurrentPage = Items.GroupSKUQuestions Then
		
		If Not Items.SKUQuestions.CurrentData = Undefined Then
			
			If ValueIsFilled(Items.SKUQuestions.CurrentData.SKUSnapShotUUID) Then 
		
				SnapshotStructure = CommonProcessors.GetSnapshot(Items.SKUQuestions.CurrentData.SKUSnapShotUUID, ThisForm.UUID, String(Record.Outlet));
				
				If Not SnapshotStructure = Undefined Then 
				 
					GetFile(SnapshotStructure.SnapshotAddress, SnapshotStructure.SnapshotName, True);
					
				EndIf;
				
			EndIf;
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure QuestionsOnActivateRow(Item)
	
	If Items.GroupPages.CurrentPage = Items.GroupQuestions Then
	
		If Not Item.CurrentRow = Undefined Then	
		
			If ItsPicture(Item.CurrentData.Question) Then 
				
				Try
					
					SnapShotUUID = New UUID(Item.CurrentData.SnapShotUUID);
					
					SetPicture(SnapShotUUID);
					
				Except
					
					PictureAddress		= Undefined;
					PictureExtension    = Undefined;
					
				EndTry;	
				
			Else 
				
				PictureAddress		= Undefined;
				PictureExtension    = Undefined;
			
			EndIf;
			
		Else
			
			PictureAddress		= Undefined;
			PictureExtension    = Undefined;

		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure SKUsOnActivateRow(Item)
	
	If Not Item.CurrentRow = Undefined Then
	
		LoadSKUAnswers(Item.CurrentData.SKU);	
		
	EndIf;	
		
EndProcedure

&AtClient
Procedure SKUQuestionsOnActivateRow(Item)
	
	If Items.GroupPages.CurrentPage = Items.GroupSKUQuestions Then
	
	    If Not Item.CurrentRow = Undefined  Then	        
			
			If ItsPicture(Item.CurrentData.Question) Then            
				
				Try
					
					SnapShotUUID = New UUID(Item.CurrentData.SKUSnapShotUUID);
					
					SetPicture(SnapShotUUID);
					
				Except
					
					PictureAddress		= Undefined;
					PictureExtension    = Undefined;
					
				EndTry;
				
			Else            
				
				PictureAddress		= Undefined;
	            PictureExtension    = Undefined;                       
				
			EndIf;                
			
		Else        
			
			PictureAddress		= Undefined;
	        PictureExtension    = Undefined;        
			
		EndIf;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure GroupPagesOnCurrentPageChange(Item, CurrentPage)
	
	If CurrentPage = Items.GroupQuestions Then
		
		SKUsOnActivateRow(Items.SKUs);
		QuestionsOnActivateRow(Items.Questions);
        
    ElsIf CurrentPage = Items.GroupSKUQuestions Then
        
        SKUQuestionsOnActivateRow(Items.SKUQuestions);
		
	Else 
		
		PictureAddress = Undefined;
		PictureExtension = Undefined;
        
	EndIf;
	
EndProcedure

#EndRegion
